---
kind: property
id: P:Autodesk.Revit.DB.FabricationAncillaryUsage.AncillaryId
source: html/9425b500-4cfd-b353-a14f-fe0e4a611207.htm
---
# Autodesk.Revit.DB.FabricationAncillaryUsage.AncillaryId Property

Fabrication ancillary database identifier.

## Syntax (C#)
```csharp
public int AncillaryId { get; }
```